// Створити масив, довжину та елементи якого задає користувач.
// Після цього, відсортувати масив за зростанням.
// Далі, видалити з масива елементи з 2-го по 4-й елемент.
// По мірі змін масива - виводити його вміст на сторінку.

let usersArray = parseInt(prompt("Введіть розмір масива"));
let arr = [];

for (let i = 0; i < usersArray; i++) {
  let usersValue = prompt(`Додайте ${i + 1}-ий елемент масиву`);
  arr.push(usersValue);
}

document.write("<b>Масив користувача:</b>" + "<br>" + arr + "<hr>");

arr.sort((a, b) => a - b);
document.write("<b>Відсортований масив за зростанням:</b>" + "<br>" + arr + "<hr>");

arr.splice(1,3);
document.write("<b>Сплайснутий 2-го по 4-й елемент масив:</b>" + "<br>" + arr);
